from django.core.validators import RegexValidator

phone_regex = RegexValidator(
    regex = r'^\+?1?\d{9,15}$',
    message = "Номер телефона повинен бути в форматі: '+380XXXXXXXXX'."
)

gender_choices = [
    ('Чоловік', 'Чоловік'),
    ('Жінка', 'Жінка'),
]

blood_group = [
    ('I Rh+', 'I Rh+'),
    ('I Rh-', 'I Rh-'),
    ('II Rh+', 'II Rh+'),
    ('II Rh-', 'II Rh-'),
    ('III Rh+', 'III Rh+'),
    ('III Rh-', 'III Rh-'),
    ('IV Rh+', 'IV Rh+'),
    ('IV Rh-', 'IV Rh-'),
]

marital_status = [
    ('Одружений', 'Одружений'),
    ('Неодружений', 'Неодружений'),
    ('Одружена', 'Одружена'),
    ('Неодружена', 'Неодружена'),
]

education = [
    ('Вища освіта', 'Вища освіта'),
    ('Середня професійна', 'Середня професійна'),
    ('Базова вища освіта', 'Базова вища освіта'),
    ('Неповна вища освіта', 'Неповна вища освіта'),
]

days_of_week = [
    ('Понеділок', 'Понеділок'),
    ('Вівторок', 'Вівторок'),
    ('Середа', 'Середа'),
    ('Четвер', 'Четвер'),
    ('П`ятниця', 'П`ятниця'),
    ('Субота', 'Субота'),
    ('Неділя', 'Неділя'),
]

status = [
    ('Підтверджено', 'Підтверджено'),
    ('Відмовлено', 'Відмовлено'),
    ('Заплановано', 'Заплановано'),
]
